import { Component } from '@angular/core';

@Component({
  selector: 'app-atms',
  templateUrl: './atms.component.html',
  styleUrls: ['./atms.component.scss']
})
export class AtmsComponent {
  regions: any = [
    {value: 'headquarter', viewValue: 'Головной офис'},
    {value: 'pizza-1', viewValue: 'г. Бохтар'},
    {value: 'tacos-2', viewValue: 'р. Шахритуз'},
    {value: 'tacos-2', viewValue: 'р. Рудаки'},
    {value: 'tacos-2', viewValue: 'р. Фирдавси'},
    {value: 'tacos-2', viewValue: 'г. Худжанд'},
  ];

  customMarkerIcon: any  = {
    url: './assets/images/pages/about/location/atm.png',
    scaledSize: {
      width: 35,
      height: 40
    }
  };
  options: google.maps.MapOptions = {
    center: {lat: 38.56189789218196, lng: 68.78516342737},
    zoom: 18,

    styles: [
      {
        featureType: 'landscape',
        elementType: 'geometry',
        stylers: [
          { hue: '#686868' },
          { saturation: 0 },
          { lightness: 0 }
        ]
      },
      {
        featureType: 'road',
        elementType: 'labels.text.fill',
        stylers: [
          { color: '#2c2c2c' }
        ]
      },
      {
        featureType: 'buildings',
        elementType: 'geometry',
        stylers: [
          { hue: '#686868' },
          { saturation: -100 }
        ]
      },
      {
        featureType: 'poi',
        stylers: [
          { visibility: 'off' }
        ]
      },
    ]
  };
  constructor() {
  }
  atms = [
    {
      address: 'Головной офис р.Фирдавси ул. С. Айни 4/1.',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.56187506936877,
      lng:  68.78517315106345
    },
    {
      address: 'г. Душанбе Филиал в р-н. Фирдавси ул А.Кахоров 75 (при филиале)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.551445493177454,
      lng: 68.7724729233923
    },
    {
      address: 'Согдийская обл. г.Гулистон пос. Зарнисор (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.648154585648705,
      lng: 69.59697737186997
    },
    {
      address: 'Согдийская обл. г.Худжанд пос. К.Худжанди 165 (при филиале)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.28156761785792,
      lng: 69.62303701427719
    },
    {
      address: 'Хатлонская обл. р-н. Кабодиён 2 ул.И.Сомони 35 (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.41178077825105,
      lng: 68.1950013315614
    },
    {
      address: 'Хатлонская обл. р-н. Шахритуз 7 ул.И.Сомони 29/8 (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.27091352113215,
      lng:  68.14780437476817
    },
    {
      address: 'Сафина р-н.Рудкӣ, ул. И.Сомони, (рынок “Сафина”) (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.442505341233165,
      lng:  68.77612346578225
    },
    {
      address: 'г. Душанбе пр.Рудаки плаза 127 (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.59620676769875,
      lng:  68.78644512922176
    },
    {
      address: 'Хатлонская обл. г.Бохтар ул. Норинов 6 (при филиале)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.834672724724285,
      lng:  68.7768289
    },
    {
      address: 'Хатлонская обл. р-н.Шаҳритуз ул. И.Сомони, 26 (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.266736936748046,
      lng:  68.14375081776683
    },
    {
      address: 'Хатлонская обл. р-н. Пяндж ул. 50 летия д. 34/7 (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.23202660984037,
      lng:  69.09504978402842
    },
    {
      address: 'Хатлонская обл. Дж.Балхи ул. Сино 24 (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.419035734912605,
      lng:  68.9510612406925
    },
    {
      address: 'Хатлонская обл. р-н. Пяндж ул. Рудаки б/н (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.23052618698867,
      lng: 69.10134162341434
    },
    {
      address: 'г.Вахдат-45 (Централный рынок) (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.51644193923049,
      lng: 68.72903455531606
    },
    {
      address: 'Согдийская обл. г.Хуҷанд ул. К.Хуҷанди 165 (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.28156761785792,
      lng: 69.62303701427719
    },
    {
      address: 'Хатлонская обл. р-н. Дусти, джамоат Нури Вахш, (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.533220528806446,
      lng: 68.4747486264298
    },
    {
      address: 'Хатлонская обл. р-н. Дж. Балхи, ул. Сино 19, (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.834576185947505,
      lng: 68.77680629223237
    },
    {
      address: 'Хатлонская обл. р-н. Ёвон, ул. Мехвар 36а (здания глав. Почта)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.3143123081005,
      lng: 69.03894305049847
    },
    {
      address: 'Хатлонская обл. р-н. Хуросон, джамоат Айни, пос. Уяли (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.265942940978356,
      lng: 68.14375347810767
    },
    {
      address: 'г.Душанбе, ул. Айни 48, (Бизнес центр "Созидание")',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.56284816745753,
      lng: 68.80893370374254
    },
    {
      address: 'Согдийская область, р-н. Зафаробод б/н (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.183887606284834,
      lng: 68.85640966400717
    },
    {
      address: 'г. Душанбе, ул С.Айни 29 (ТЦ Ватан)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.56344527125462,
      lng: 68.79731740034428
    },
    {
      address: 'г. Душанбе, пос. Гипрозем, ул. Борбад-139 (ТЦ Халиф)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.514257365658665,
      lng: 68.74298765044999
    },
    {
      address: 'г. Душанбе, мкр. 103, (ТЦ Сияриён)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.571582340584904,
      lng: 68.74037852290027
    },
    {
      address: 'г. Душанбе, ул.Фирдавси 8, (ТЦ Сиёма Молл)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.519421236412384,
      lng:  68.75284202728598
    },
    {
      address: 'г. Турсунзода, ул. И.Сомони 8, (при ЦБО)',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.51082905993192,
      lng: 68.23378072716018
    },
    {
      address: 'р.Восе, Хулбук кучаи Султони Кабир 82',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.80567580198357,
      lng: 69.63665915960213
    },
    {
      address: 'Филиал ОАО “Тавхидбонк” в р.Рудаки, Пушкина 42',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.44217571403086,
      lng: 68.77431617020443
    },
    {
      address: 'г.Худжанд Микрорайон 19 М/С ОАЗИС',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.23479103245573,
      lng: 69.6961381655734
    },
    {
      address: 'Бонки марказӣ  н.Фирдавси кучаи Айни 4/1.',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.56200314940503,
      lng: 68.78529431917462
    },
    {
      address: 'р. Пяндж ул. Рудаки',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.23052618698867,
      lng: 69.10134162341434
    },
    {
      address: 'р.Ашт, Шайдон ул. Исмоили Сомони',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.66432771565648,
      lng: 70.35635373698958
    },
    {
      address: 'г.Истаравшан ул. Исмоили Сомони',
      graphic: '24 часа',
      cash: 'Да',
      lat: 39.90268781999013,
      lng: 69.00094544013601
    },
    {
      address: 'г.Душанбе ул. Мехнат 4 М/С "Истиқлол"',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.58561061041767,
      lng: 68.799218249868
    },
    {
      address: 'г.Турсунзода ул. Парпи Точиев',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.513386,
      lng: 668.233606
    },
    {
      address: 'г.Бохтар ул. Джалилов 102',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.831621670294304,
      lng: 68.76511044747447
    },
    {
      address: 'Район А.Джоми ул. Сомониён 32',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.947849806951965,
      lng: 68.79742379480739
    },
    {
      address: 'г.Хуҷанд кл. Рахмон Набиев 1',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.29183356829012,
      lng: 69.63855612883617
    },
    {
      address: 'р.Зарнисор прос.И Сомони 22 при Филиал Худжанд',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.648154585648705,
      lng: 69.59697737186997
    },
    {
      address: 'г.Ваҳдат ул. Истиқлолият 20',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.55711281922677,
      lng: 69.01936896988605
    },
    {
      address: 'г.Хисор ТЦ B1',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.52682477364034,
      lng: 68.55435804264229
    },
    {
      address: 'г.Душанбе р.Сино около Испечак',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.59066588896101,
      lng: 68.73376104458269
    },
    {
      address: 'г.Душанбе р.Сино около Цирк ТЦ.B1',
      graphic: '24 часа',
      cash: 'Да',
      lat: 38.556496383243974,
      lng: 68.76250201771414
    },
    {
      address: 'Согдийская область г.Бустон ТЦ "ОАЗИЗ"',
      graphic: '24 часа',
      cash: 'Да',
      lat: 40.29725411712463,
      lng: 69.61323671534471
    },
    {
      address: 'р.Шаъритус, ул. Н.Хусрав, ТЦ “Оишаи Шахритус”',
      graphic: '24 часа',
      cash: 'Да',
      lat: 37.264941,
      lng: 68.142894
    },
  ]
  filteredAtms: any[] = this.atms;

  isSearching = false;

  updateCenter(event: any): void {
    const searchTerm = event.target.value.toLowerCase();

    // Если введен текст, фильтруем массив
    if (searchTerm) {
      this.filteredAtms = this.atms.filter(atm =>
        atm.address.toLowerCase().includes(searchTerm)
      );
      this.isSearching = true; // Устанавливаем флаг поиска
    } else {
      this.filteredAtms = this.atms; // В противном случае отображаем все маркеры
      this.isSearching = false; // Сбрасываем флаг поиска
    }
  }
}
