import { Component } from '@angular/core';

@Component({
  selector: 'app-graphic',
  templateUrl: './graphic.component.html',
  styleUrls: ['./graphic.component.scss']
})
export class GraphicComponent {
  peopleMain: any[] = [
    {
      name: 'Мирзоали Анвар Умад',
      duty: 'Сардори Хдамоти махсус',
      date: 'Понидельник, 01.12.2023г',
      time: '14:00 - 16:30'
    },
    {
      name: 'Норматов Донёр Мадибрагимович',
      duty: 'Сардори Шуъбаи протоколӣ ва ҳифзи меҳнат',
      date: 'Понидельник, 04.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Раупова Парвона Алишеровна',
      duty: 'Сардори Хадамоти мониторинги хавфҳои бонкӣ',
      date: 'Вторник, 05.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Дустмуродов Исомиддин Элмуродович',
      duty: 'Сардори Маркази Ҳисоббаробаркунӣ',
      date: 'Среда, 06.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Бегов Ҷамшед Юсуфович',
      duty: 'Сардори Идораи технологияҳои иттилоотӣ',
      date: 'Четверг, 07.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Гаримадов Меҳроб Оташхонович',
      duty: 'Сардори Шуъбаи муомилоти пулӣ',
      date: 'Пятница, 08.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Солеҳов Зинатулло Шарифович',
      duty: 'Сардори Хадамоти бехатарӣ',
      date: 'Понидельник, 11.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Норов Талабшоҳ Муҳаббатович',
      duty: 'Сардори Шуъбаи маъмурӣ',
      date: 'Вторник, 12.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Максудов Азамат Зафарович',
      duty: 'Сардори Шуъбаи маркетинг',
      date: 'Среда, 13.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Лалбеков Пайшанбе Каландарович',
      duty: 'Сардори Идораи технологияҳои иттилоотӣ',
      date: 'Четверг, 14.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Давлатов Фарух Рахмоналиевич',
      duty: 'Сармукосиб - Сардори Идораи муҳосибот ва молия',
      date: 'Пятница, 15.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Фозылов Убайдулло Рахимович',
      duty: 'Сардори Шуъбаи исломӣ',
      date: 'Понидельник, 18.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Абдулхадов Назрулло Абдуназарович',
      duty: 'Сардори Шуъбаи нигоҳдошти инфрасохторӣ',
      date: 'Вторник, 19.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Буриева Муаззама Ҳикматуллоевна',
      duty: 'Сардори Маркази таълимй',
      date: 'Среда, 20.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Ҳакимов Масрур Равшанович',
      duty: 'Сармутахассиси Хадамоти аудити дохилӣ',
      date: 'Четверг, 14.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Норов Талабшоя Муҳаббатович',
      duty: 'Сардори Шуъбаи маъмурӣ',
      date: 'Пятница, 15.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Нуров Шамсиддин Абдурауфович',
      duty: 'Сардори Хадамоти кадрӢ',
      date: 'Понидельник, 25.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Холов Низомиддин Мирзоалиевич',
      duty: 'Сардори Хадамоти мониторинги молиявӣ ва комплаенс',
      date: 'Вторник, 26.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Рахимов Насруллонон Абдунасибович',
      duty: 'Ҷонишини сардори Идораи амалиётӣ',
      date: 'Среда, 27.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Самадов Деҳқон Андалибович',
      duty: 'Сардори Идораи маблағгузории исломӣ',
      date: 'Четверг, 28.12.2023с',
      time: '14:00 - 16:30'
    },
    {
      name: 'Ташрифов Макмадюсуф Сангинмуродович',
      duty: 'Мушовири Раис оиди рушди стратегӣ',
      date: 'Пятница, 29.12.2023с',
      time: '14:00 - 16:30'
    },
  ]
}
